#### Libraries

In [1]:
import dspy
import numpy as np
from dotenv import load_dotenv
from dspy.datasets import DataLoader
from dspy.evaluate import Evaluate
from dspy.teleprompt import BootstrapFewShotWithRandomSearch, LabeledFewShot

from src.starling import StarlingLM # <- Custom Local Model Client for Starling7B

_ = load_dotenv()

#### LLM

The model that will be used in this notebook is [Starling7B](https://huggingface.co/Nexusflow/Starling-LM-7B-beta), and the evaluation model will be [GPT-4 Turbo](https://openai.com/gpt-4).

In [2]:
# Share generation args between models
generation_args = {
    "temperature":0,
    "max_tokens":500,
    "stop":"\n\n",
    "model_type":"chat",
    "n": 1
}
# Model specific args
model_info = {
    "gpt-4": {"model": "gpt-4-0125-preview", "api_base": "https://api.openai.com/v1/"},
    "starling": {"model": "Nexusflow/Starling-LM-7B-beta"}
}

In [3]:
# Set up the models
lm = StarlingLM(**model_info["starling"], **generation_args)
evaluator_lm = dspy.OpenAI(**model_info["gpt-4"], **generation_args)

dspy.configure(lm=lm)

In [4]:
# Testing inference of Starling
lm("What is the capital of Colombia?")

[' The capital of Colombia is Bogotá. It is the largest city in the country and serves as the political, economic, and cultural center of Colombia. Located in the Andean region of the country, Bogotá has a rich history and is known for its vibrant arts scene, diverse architecture, and numerous museums and cultural institutions.']

#### Load dataset

The dataset that will be used in this notebook is [gretelai/synthetic_text_to_sql](https://huggingface.co/datasets/gretelai/synthetic_text_to_sql)

In [5]:
# Define random seed
np.random.seed(1399)

In [6]:
# Load dataset
dl = DataLoader()
dataset = dl.from_huggingface(
    dataset_name="gretelai/synthetic_text_to_sql", # Dataset name from Huggingface
    fields=("sql_prompt", "sql_context", "sql"), # Fields needed
    input_keys=("sql_prompt", "sql_context") # What our model expects to recieve to generate an output
)
trainset, testset = dl.sample(dataset["train"], n=50), dl.sample(dataset["test"], n=25) # 50 training samples, 25 testing samples

In [7]:
# Verify an example of the dataset
sample = dl.sample(dataset=trainset, n=1)[0]
for k, v in sample.items():
    print(f"\n{k.upper()}:\n")
    print(v)

SQL_PROMPT:

What are the top 5 most purchased lipsticks based on sales volume across all regions?

SQL_CONTEXT:

CREATE TABLE lipsticks (lipstick_id INT, lipstick_name VARCHAR(100), region VARCHAR(50), sales_volume INT); INSERT INTO lipsticks (lipstick_id, lipstick_name, region, sales_volume) VALUES (1, 'Ruby Woo', 'North America', 1500), (2, 'Russian Red', 'Europe', 1200), (3, 'Cherry', 'Asia', 1800), (4, 'Lady Danger', 'South America', 1000), (5, 'Mademoiselle', 'Australia', 1600);

SQL:

SELECT lipstick_name, SUM(sales_volume) FROM lipsticks GROUP BY lipstick_name ORDER BY SUM(sales_volume) DESC LIMIT 5;

#### Signature (Input/Output)

In [8]:
class TextToSql(dspy.Signature):
    """Transform a natural language query into a SQL query."""

    sql_prompt = dspy.InputField(desc="Natural language query")
    sql_context = dspy.InputField(desc="Context for the query")
    sql = dspy.OutputField(desc="SQL query")

### Inference

#### Baseline Inference

In [9]:
generate_sql_query = dspy.Predict(signature=TextToSql)

result = generate_sql_query(
    sql_prompt=sample["sql_prompt"],
    sql_context=sample["sql_context"]
)

for k, v in result.items():
    print(f"\n{k.upper()}:\n")
    print(v)

SQL:

SELECT lipstick_name, SUM(sales_volume) as total_sales
FROM lipsticks
GROUP BY lipstick_name
ORDER BY total_sales DESC
LIMIT 5;

#### ChainOfThought Inference

In [10]:
generate_sql_query = dspy.ChainOfThought(signature=TextToSql)

result = generate_sql_query(
    sql_prompt=sample["sql_prompt"],
    sql_context=sample["sql_context"]
)

for k, v in result.items():
    print(f"\n{k.upper()}:\n")
    print(v)

RATIONALE:

produce the SQL query. We need to find the top 5 most purchased lipsticks based on sales volume across all regions.

SQL:

SELECT lipstick_name, SUM(sales_volume) as total_sales
FROM lipsticks
GROUP BY lipstick_name
ORDER BY total_sales DESC
LIMIT 5;

### Metric of evaluation

#### Metric definition

In [12]:
class Correctness(dspy.Signature):
    """Assess if the SQL query accurately answers the given natural language query based on the provided context."""

    sql_prompt = dspy.InputField(desc="Natural language query ")
    sql_context = dspy.InputField(desc="Context for the query")
    sql = dspy.InputField(desc="SQL query")
    correct = dspy.OutputField(desc="Indicate whether the SQL query correctly answers the natural language query based on the given context", prefix="Yes/No:")

In [13]:
def correctness_metric(example, pred, trace=None):
    sql_prompt, sql_context, sql = example.sql_prompt, example.sql_context, pred.sql

    correctness = dspy.Predict(Correctness)

    with dspy.context(lm=evaluator_lm): 
        correct = correctness(
            sql_prompt=sql_prompt,
            sql_context=sql_context,
            sql=sql,
        )
    
    score = int(correct.correct=="Yes")

    if trace is not None:
        return score == 1

    return score

#### Evaluate single data point

In [19]:
_correctness = correctness_metric(
    example=sample,
    pred=result
)
print(f"Correct SQL query: {'Yes' if _correctness else 'No'}")

Correct SQL query: Yes

In [20]:
evaluator_lm.inspect_history(n=1)

Assess if the SQL query accurately answers the given natural language query based on the provided context.

---

Follow the following format.

Sql Prompt: Natural language query

Sql Context: Context for the query

Sql: SQL query

Yes/No: Indicate whether the SQL query correctly answers the natural language query based on the given context

---

Sql Prompt: What are the top 5 most purchased lipsticks based on sales volume across all regions?

Sql Context: CREATE TABLE lipsticks (lipstick_id INT, lipstick_name VARCHAR(100), region VARCHAR(50), sales_volume INT); INSERT INTO lipsticks (lipstick_id, lipstick_name, region, sales_volume) VALUES (1, 'Ruby Woo', 'North America', 1500), (2, 'Russian Red', 'Europe', 1200), (3, 'Cherry', 'Asia', 1800), (4, 'Lady Danger', 'South America', 1000), (5, 'Mademoiselle', 'Australia', 1600);

Sql: SELECT lipstick_name, SUM(sales_volume) as total_sales FROM lipsticks GROUP BY lipstick_name ORDER BY total_sales DESC LIMIT 5;

Yes/No: Yes

#### Evaluate entire dataset - GPT 3.5

<div style="background-color: #F0F0F0; padding: 10px; border-radius: 5px;"> <p style="color: #4B4B4B; font-size: 18px; font-weight: bold; margin: 0;"> 📊 Baseline Result </p> <p style="color: #4B4B4B; font-size: 16px; margin: 5px 0 0;"> Without any optimization, <strong>GPT 3.5 Turbo</strong> achieves a <strong>68% correctness</strong> in the evaluation of 25 test samples. </p> </div>

In [33]:
with dspy.context(lm=dspy.OpenAI(model="gpt-3.5-turbo-0125", api_base="https://api.openai.com/v1/", **generation_args)):
    evaluate = Evaluate(devset=testset, metric=correctness_metric, num_threads=10, display_progress=True, display_table=5)
    evaluate(generate_sql_query)

Average Metric: 17 / 25  (68.0): 100%|██████████| 25/25 [00:07<00:00,  3.53it/s]

Average Metric: 17 / 25  (68.0%)

/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:187: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(truncate_cell)
/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:263: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['1' '1' '0' '1' '1']' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:, metric_name] = df[metric_name].apply(

#### Evaluate entire dataset - Starling7B

<div style="background-color: #FFCCCB; padding: 10px; border-radius: 5px;"> <p style="color: #8B0000; font-size: 18px; font-weight: bold; margin: 0;"> ⚠️ Evaluation Result </p> <p style="color: #8B0000; font-size: 16px; margin: 5px 0 0;"> Without any optimization, <strong>Starling7B</strong> achieves a <strong>60% correctness</strong> in the evaluation of 25 test samples. </p> </div>

In [21]:
evaluate = Evaluate(devset=testset, metric=correctness_metric, num_threads=10, display_progress=True, display_table=5)
evaluate(generate_sql_query)

Average Metric: 15 / 25  (60.0): 100%|██████████| 25/25 [00:13<00:00,  1.82it/s]

Average Metric: 15 / 25  (60.0%)

/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:187: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(truncate_cell)
/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:263: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['1' '1' '0' '1' '1']' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:, metric_name] = df[metric_name].apply(

60.0

### Optimize for Text2SQL

#### Create program

In [22]:
# Define the program ~ You can think of this a Pytorch model.
class TextToSqlProgram(dspy.Module):
    def __init__(self):
        super().__init__()
        self.program = dspy.ChainOfThought(signature=TextToSql)
    
    def forward(self, sql_prompt, sql_context):
        return self.program(
            sql_prompt=sql_prompt,
            sql_context=sql_context
        )

### FewShot

In [23]:
# Execute the optimizer -> this only adds few shots to the prompt
optimizer = LabeledFewShot(k=4)
optmized_program = optimizer.compile(student=TextToSqlProgram(), trainset=trainset)

In [24]:
optmized_program(sql_context=sample["sql_context"], sql_prompt=sample["sql_prompt"])

Prediction(
    rationale='produce the SQL query. We want to find the top 5 most purchased lipsticks based on sales volume across all regions.',
    sql='SELECT lipstick_name, SUM(sales_volume) as total_sales\nFROM lipsticks\nGROUP BY lipstick_name\nORDER BY total_sales DESC\nLIMIT 5;'
)

#### What is happening inside?

In [25]:
lm.inspect_history(n=1)

Transform a natural language query into a SQL query.

---

Sql Prompt: Identify the top 2 water consuming industries in California in 2021.
Sql Context: CREATE TABLE industrial_water_usage (state VARCHAR(20), year INT, sector VARCHAR(30), usage FLOAT); INSERT INTO industrial_water_usage (state, year, sector, usage) VALUES ('California', 2021, 'Agriculture', 45612.3), ('California', 2021, 'Manufacturing', 34567.2), ('California', 2021, 'Mining', 23456.1), ('California', 2021, 'Gasoline Production', 12345.0), ('California', 2021, 'Food Processing', 56789.0);
Sql: SELECT sector, usage FROM industrial_water_usage WHERE state = 'California' AND year = 2021 ORDER BY usage DESC LIMIT 2;

Sql Prompt: What are the textile sourcing countries with a sustainability rating greater than 75?
Sql Context: CREATE TABLE sourcing (id INT, country VARCHAR(20), sustainability_rating INT); INSERT INTO sourcing (id, country, sustainability_rating) VALUES (1, 'China', 70); INSERT INTO sourcing (id, country, sustainability_rating) VALUES (2, 'Italy', 85);
Sql: SELECT country FROM sourcing WHERE sustainability_rating > 75;

Sql Prompt: What is the average donation amount from donors located in Canada in the past year?
Sql Context: CREATE TABLE Donors (DonorID INT, DonorName TEXT, DonationAmount DECIMAL, DonationDate DATE); INSERT INTO Donors (DonorID, DonorName, DonationAmount, DonationDate) VALUES (1, 'John Doe', 50.00, '2021-05-15'), (2, 'Jane Smith', 100.00, '2021-02-10'), (3, 'Michael Lee', 75.00, '2020-12-25');
Sql: SELECT AVG(DonationAmount) FROM Donors WHERE DonorName IN (SELECT DonorName FROM Donors WHERE DonationDate >= DATE_SUB(CURRENT_DATE, INTERVAL 1 YEAR) AND Country = 'Canada') AND DonationDate >= DATE_SUB(CURRENT_DATE, INTERVAL 1 YEAR);

Sql Prompt: What is the minimum donation amount for donors from India?
Sql Context: CREATE TABLE donations (id INT, donor_id INT, amount DECIMAL); INSERT INTO donations (id, donor_id, amount) VALUES (1, 1, 50.00), (2, 2, 100.00); CREATE TABLE donors (id INT, name TEXT, country TEXT); INSERT INTO donors (id, name, country) VALUES (1, 'Ravi', 'India'), (2, 'Sita', 'Nepal');
Sql: SELECT MIN(amount) FROM donations JOIN donors ON donations.donor_id = donors.id WHERE donors.country = 'India';

---

Follow the following format.

Sql Prompt: Natural language query

Sql Context: Context for the query

Reasoning: Let's think step by step in order to ${produce the sql}. We ...

Sql: SQL query

---

Sql Prompt: What are the top 5 most purchased lipsticks based on sales volume across all regions?

Sql Context: CREATE TABLE lipsticks (lipstick_id INT, lipstick_name VARCHAR(100), region VARCHAR(50), sales_volume INT); INSERT INTO lipsticks (lipstick_id, lipstick_name, region, sales_volume) VALUES (1, 'Ruby Woo', 'North America', 1500), (2, 'Russian Red', 'Europe', 1200), (3, 'Cherry', 'Asia', 1800), (4, 'Lady Danger', 'South America', 1000), (5, 'Mademoiselle', 'Australia', 1600);

Reasoning: Let's think step by step in order to produce the SQL query. We want to find the top 5 most purchased lipsticks based on sales volume across all regions.

Sql: SELECT lipstick_name, SUM(sales_volume) as total_sales
FROM lipsticks
GROUP BY lipstick_name
ORDER BY total_sales DESC
LIMIT 5;

#### Evaluate the optimized program


<div style="background-color: #FFF8DC; padding: 10px; border-radius: 5px;"> <p style="color: #DAA520; font-size: 18px; font-weight: bold; margin: 0;"> 🌟 Evaluation Progress </p> <p style="color: #DAA520; font-size: 16px; margin: 5px 0 0;"> With Few Shot Optimization, <strong>Starling7B</strong> achieves a <strong>72.0% correctness</strong> in the evaluation of 25 test samples. </p> </div>

In [26]:
evaluate(optmized_program)

Average Metric: 18 / 25  (72.0): 100%|██████████| 25/25 [00:14<00:00,  1.72it/s]

Average Metric: 18 / 25  (72.0%)

/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:187: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(truncate_cell)
/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:263: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['1' '1' '1' '0' '1']' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:, metric_name] = df[metric_name].apply(

72.0

### BootstrapFewShotWithRandomSearch

[DSPy docs](https://dspy-docs.vercel.app/docs/building-blocks/optimizers) recommend that in a setup like the one with have at hand, with ~50 samples, the best option is to use `BootstrapFewShotWithRandomSearch`:

![image](assets/dspy.png)

In [27]:
optimizer2 = BootstrapFewShotWithRandomSearch(metric=correctness_metric, max_bootstrapped_demos=2, num_candidate_programs=8, num_threads=5)
optmized_program_2 = optimizer2.compile(student = TextToSqlProgram(), trainset=trainset, valset=testset)

Going to sample between 1 and 2 traces per predictor.
Will attempt to train 8 candidate sets.

Average Metric: 15 / 25  (60.0): 100%|██████████| 25/25 [00:20<00:00,  1.20it/s]
/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:187: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(truncate_cell)

Average Metric: 15 / 25  (60.0%)
Score: 60.0 for set: [0]
New best score: 60.0 for seed -3
Scores so far: [60.0]
Best score: 60.0

Average Metric: 18 / 25  (72.0): 100%|██████████| 25/25 [00:30<00:00,  1.22s/it]

Average Metric: 18 / 25  (72.0%)
Score: 72.0 for set: [16]
New best score: 72.0 for seed -2
Scores so far: [60.0, 72.0]
Best score: 72.0

  6%|▌         | 3/50 [00:14<03:47,  4.85s/it]

Bootstrapped 2 full traces after 4 examples in round 0.

Average Metric: 14 / 25  (56.0): 100%|██████████| 25/25 [00:28<00:00,  1.14s/it]

Average Metric: 14 / 25  (56.0%)
Score: 56.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0]
Best score: 72.0
Average of max per entry across top 1 scores: 0.72
Average of max per entry across top 2 scores: 0.84
Average of max per entry across top 3 scores: 0.84
Average of max per entry across top 5 scores: 0.84
Average of max per entry across top 8 scores: 0.84
Average of max per entry across top 9999 scores: 0.84

  6%|▌         | 3/50 [00:13<03:25,  4.37s/it]

Bootstrapped 2 full traces after 4 examples in round 0.

Average Metric: 18 / 25  (72.0): 100%|██████████| 25/25 [00:28<00:00,  1.15s/it]

Average Metric: 18 / 25  (72.0%)
Score: 72.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0, 72.0]
Best score: 72.0
Average of max per entry across top 1 scores: 0.72
Average of max per entry across top 2 scores: 0.92
Average of max per entry across top 3 scores: 0.92
Average of max per entry across top 5 scores: 0.92
Average of max per entry across top 8 scores: 0.92
Average of max per entry across top 9999 scores: 0.92

  2%|▏         | 1/50 [00:03<03:12,  3.92s/it]

Bootstrapped 1 full traces after 2 examples in round 0.

Average Metric: 16 / 25  (64.0): 100%|██████████| 25/25 [00:30<00:00,  1.22s/it]

Average Metric: 16 / 25  (64.0%)
Score: 64.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0, 72.0, 64.0]
Best score: 72.0
Average of max per entry across top 1 scores: 0.72
Average of max per entry across top 2 scores: 0.92
Average of max per entry across top 3 scores: 0.96
Average of max per entry across top 5 scores: 0.96
Average of max per entry across top 8 scores: 0.96
Average of max per entry across top 9999 scores: 0.96

  2%|▏         | 1/50 [00:04<03:25,  4.20s/it]

Bootstrapped 1 full traces after 2 examples in round 0.

Average Metric: 17 / 25  (68.0): 100%|██████████| 25/25 [00:29<00:00,  1.20s/it]

Average Metric: 17 / 25  (68.0%)
Score: 68.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0, 72.0, 64.0, 68.0]
Best score: 72.0
Average of max per entry across top 1 scores: 0.72
Average of max per entry across top 2 scores: 0.92
Average of max per entry across top 3 scores: 0.96
Average of max per entry across top 5 scores: 1.0
Average of max per entry across top 8 scores: 1.0
Average of max per entry across top 9999 scores: 1.0

  4%|▍         | 2/50 [00:08<03:14,  4.05s/it]

Bootstrapped 1 full traces after 3 examples in round 0.

Average Metric: 20 / 25  (80.0): 100%|██████████| 25/25 [00:33<00:00,  1.36s/it]

Average Metric: 20 / 25  (80.0%)
Score: 80.0 for set: [16]
New best score: 80.0 for seed 3
Scores so far: [60.0, 72.0, 56.0, 72.0, 64.0, 68.0, 80.0]
Best score: 80.0
Average of max per entry across top 1 scores: 0.8
Average of max per entry across top 2 scores: 0.88
Average of max per entry across top 3 scores: 0.92
Average of max per entry across top 5 scores: 1.0
Average of max per entry across top 8 scores: 1.0
Average of max per entry across top 9999 scores: 1.0

  2%|▏         | 1/50 [00:07<06:15,  7.67s/it]

Bootstrapped 1 full traces after 2 examples in round 0.

Average Metric: 19 / 25  (76.0): 100%|██████████| 25/25 [00:28<00:00,  1.14s/it]

Average Metric: 19 / 25  (76.0%)
Score: 76.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0, 72.0, 64.0, 68.0, 80.0, 76.0]
Best score: 80.0
Average of max per entry across top 1 scores: 0.8
Average of max per entry across top 2 scores: 0.84
Average of max per entry across top 3 scores: 0.88
Average of max per entry across top 5 scores: 0.96
Average of max per entry across top 8 scores: 1.0
Average of max per entry across top 9999 scores: 1.0

  4%|▍         | 2/50 [00:09<03:39,  4.56s/it]

Bootstrapped 2 full traces after 3 examples in round 0.

Average Metric: 17 / 25  (68.0): 100%|██████████| 25/25 [00:29<00:00,  1.18s/it]

Average Metric: 17 / 25  (68.0%)
Score: 68.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0, 72.0, 64.0, 68.0, 80.0, 76.0, 68.0]
Best score: 80.0
Average of max per entry across top 1 scores: 0.8
Average of max per entry across top 2 scores: 0.84
Average of max per entry across top 3 scores: 0.88
Average of max per entry across top 5 scores: 0.96
Average of max per entry across top 8 scores: 1.0
Average of max per entry across top 9999 scores: 1.0

  2%|▏         | 1/50 [00:03<02:45,  3.37s/it]

Bootstrapped 1 full traces after 2 examples in round 0.

Average Metric: 17 / 25  (68.0): 100%|██████████| 25/25 [00:26<00:00,  1.08s/it]

Average Metric: 17 / 25  (68.0%)
Score: 68.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0, 72.0, 64.0, 68.0, 80.0, 76.0, 68.0, 68.0]
Best score: 80.0
Average of max per entry across top 1 scores: 0.8
Average of max per entry across top 2 scores: 0.84
Average of max per entry across top 3 scores: 0.88
Average of max per entry across top 5 scores: 0.96
Average of max per entry across top 8 scores: 1.0
Average of max per entry across top 9999 scores: 1.0

  4%|▍         | 2/50 [00:09<03:47,  4.75s/it]

Bootstrapped 2 full traces after 3 examples in round 0.

Average Metric: 18 / 25  (72.0): 100%|██████████| 25/25 [00:30<00:00,  1.23s/it]

Average Metric: 18 / 25  (72.0%)
Score: 72.0 for set: [16]
Scores so far: [60.0, 72.0, 56.0, 72.0, 64.0, 68.0, 80.0, 76.0, 68.0, 68.0, 72.0]
Best score: 80.0
Average of max per entry across top 1 scores: 0.8
Average of max per entry across top 2 scores: 0.84
Average of max per entry across top 3 scores: 0.88
Average of max per entry across top 5 scores: 0.96
Average of max per entry across top 8 scores: 1.0
Average of max per entry across top 9999 scores: 1.0
11 candidate programs found.

In [28]:
optmized_program_2(sql_context=sample["sql_context"], sql_prompt=sample["sql_prompt"])

Prediction(
    rationale='produce the SQL query. We need to find the top 5 most purchased lipsticks based on sales volume across all regions.',
    sql='SELECT lipstick_name, SUM(sales_volume) as total_sales_volume\nFROM lipsticks\nGROUP BY lipstick_name\nORDER BY total_sales_volume DESC\nLIMIT 5;'
)

In [29]:
lm.inspect_history(n=1)

Transform a natural language query into a SQL query.

---

Sql Prompt: What are the total clinical trial expenses for drug 'DrugG' in 2022?
Sql Context: CREATE TABLE clinical_trials (drug VARCHAR(50), year INT, expenses INT); INSERT INTO clinical_trials (drug, year, expenses) VALUES ('DrugG', 2022, 8000000), ('DrugH', 2022, 9000000);
Sql: SELECT expenses FROM clinical_trials WHERE drug = 'DrugG' AND year = 2022;

Sql Prompt: Insert a new record for a donation of $250 made by a donor from India to the Health category on March 15, 2022.
Sql Context: CREATE TABLE Donations (DonationID INT, DonorID INT, Amount DECIMAL, DonationDate DATE, Country TEXT); INSERT INTO Donations (DonationID, DonorID, Amount, DonationDate, Country) VALUES (1, 1, 50, '2022-01-01', 'USA'), (2, 1, 75, '2022-01-01', 'USA'), (3, 2, 100, '2022-02-01', 'Canada'), (4, 3, 200, '2022-03-01', 'Mexico'), (5, 4, 150, '2022-03-01', 'Brazil'); CREATE TABLE ProgramCategories (CategoryID INT, Category TEXT); INSERT INTO ProgramCategories (CategoryID, Category) VALUES (1, 'Education'), (2, 'Health'), (3, 'Environment'), (4, 'Other'); CREATE TABLE Programs (ProgramID INT, CategoryID INT); INSERT INTO Programs (ProgramID, CategoryID) VALUES (101, 1), (102, 2), (103, 3), (104, 4);
Sql: INSERT INTO Donations (DonationID, DonorID, Amount, DonationDate, Country) VALUES (6, NULL, 250, '2022-03-15', 'India'); UPDATE Donations SET ProgramID = (SELECT P.ProgramID FROM Programs P INNER JOIN ProgramCategories PC ON P.CategoryID = PC.CategoryID WHERE PC.Category = 'Health') WHERE DonationID = 6;

Sql Prompt: What are the unique game genres played on VR headsets?
Sql Context: CREATE TABLE GameVR (GameID INT, GameName VARCHAR(20), VRHeadset VARCHAR(10), Genre VARCHAR(20)); INSERT INTO GameVR (GameID, GameName, VRHeadset, Genre) VALUES (1, 'GameE', 'Oculus', 'Adventure'), (2, 'GameF', 'Vive', 'Simulation'), (3, 'GameG', 'Oculus', 'Strategy'), (4, 'GameH', 'Vive', 'Adventure');
Sql: SELECT DISTINCT Genre FROM GameVR WHERE VRHeadset IS NOT NULL;

Sql Prompt: Identify the top 2 water consuming industries in California in 2021.
Sql Context: CREATE TABLE industrial_water_usage (state VARCHAR(20), year INT, sector VARCHAR(30), usage FLOAT); INSERT INTO industrial_water_usage (state, year, sector, usage) VALUES ('California', 2021, 'Agriculture', 45612.3), ('California', 2021, 'Manufacturing', 34567.2), ('California', 2021, 'Mining', 23456.1), ('California', 2021, 'Gasoline Production', 12345.0), ('California', 2021, 'Food Processing', 56789.0);
Sql: SELECT sector, usage FROM industrial_water_usage WHERE state = 'California' AND year = 2021 ORDER BY usage DESC LIMIT 2;

Sql Prompt: Create a table named 'farm_locations'
Sql Context: CREATE TABLE farm_locations (location_id INT PRIMARY KEY, location_name VARCHAR(255), country VARCHAR(255), ocean VARCHAR(255));
Sql: CREATE TABLE farm_locations (location_id INT PRIMARY KEY, location_name VARCHAR(255), country VARCHAR(255), ocean VARCHAR(255));

Sql Prompt: What are the top 3 cities with the most news articles published about them in the "news_articles" table, and their corresponding article counts?
Sql Context: CREATE TABLE news_articles (article_id INT, city VARCHAR(255));
Sql: SELECT city, COUNT(*) AS article_count FROM news_articles GROUP BY city ORDER BY article_count DESC LIMIT 3;

Sql Prompt: What is the total quantity of coal extracted at the 'South' region mines in Q1 2022?
Sql Context: CREATE TABLE coal_production (site_id INT, site_name TEXT, region TEXT, month INT, year INT, coal_quantity INT); INSERT INTO coal_production (site_id, site_name, region, month, year, coal_quantity) VALUES (4, 'JKL Mine', 'South', 1, 2022, 5000), (5, 'MNO Mine', 'South', 2, 2022, 6000), (6, 'PQR Mine', 'South', 3, 2022, 7000);
Sql: SELECT region, SUM(coal_quantity) as total_q1_2022 FROM coal_production WHERE region = 'South' AND month BETWEEN 1 AND 3 AND year = 2022 GROUP BY region;

Sql Prompt: How many participants are involved in community development initiatives in suburban areas?
Sql Context: CREATE TABLE CommunityDevelopment (id INT, project_id INT, initiative VARCHAR(255), participants INT, success_rate FLOAT, community_type VARCHAR(255)); CREATE TABLE AgriculturalProjects (id INT, project_name VARCHAR(255), location VARCHAR(255), start_date DATE, end_date DATE, budget FLOAT); INSERT INTO AgriculturalProjects (id, project_name, location, start_date, end_date, budget) VALUES (1, 'Drip Irrigation', 'Suburb A', '2018-01-01', '2019-01-01', 5000.00); INSERT INTO CommunityDevelopment (id, project_id, initiative, participants, success_rate, community_type) VALUES (1, 1, 'Youth Empowerment', 100, 0.90, 'Suburban');
Sql: SELECT AgriculturalProjects.location, CommunityDevelopment.initiative, SUM(CommunityDevelopment.participants) as total_participants FROM AgriculturalProjects INNER JOIN CommunityDevelopment ON AgriculturalProjects.id = CommunityDevelopment.project_id WHERE AgriculturalProjects.location = 'Suburb A' GROUP BY AgriculturalProjects.location, CommunityDevelopment.initiative;

Sql Prompt: What is the average temperature recorded in Svalbard in January 2020?
Sql Context: CREATE TABLE WeatherData (location VARCHAR(50), date DATE, temperature FLOAT); INSERT INTO WeatherData (location, date, temperature) VALUES ('Svalbard', '2020-01-01', -5.0), ('Svalbard', '2020-01-02', -6.0), ('Svalbard', '2020-01-03', -4.5);
Sql: SELECT AVG(temperature) FROM WeatherData WHERE location = 'Svalbard' AND date BETWEEN '2020-01-01' AND '2020-01-31';

Sql Prompt: What is the total energy consumption of buildings constructed before 2010 in the 'GreenBuildings' table?
Sql Context: CREATE TABLE GreenBuildings (id INT, name VARCHAR(50), constructionDate DATE, location VARCHAR(50), energyConsumption DECIMAL(5,2));
Sql: SELECT SUM(energyConsumption) FROM GreenBuildings WHERE constructionDate < '2010-01-01';

Sql Prompt: What is the total amount of funding raised by biotech startups in the top 3 countries with the most funding, grouped by their founding year?
Sql Context: CREATE TABLE biotech_startups (id INT PRIMARY KEY, name VARCHAR(255), total_funding DECIMAL(10,2), founding_year INT, country VARCHAR(255));
Sql: SELECT founding_year, country, SUM(total_funding) FROM biotech_startups WHERE country IN (SELECT country FROM biotech_startups GROUP BY country ORDER BY SUM(total_funding) DESC LIMIT 3) GROUP BY founding_year, country;

Sql Prompt: What is the maximum number of students enrolled in a course in each department?
Sql Context: CREATE TABLE departments (dept_id INT, dept_name TEXT); CREATE TABLE courses (course_id INT, course_name TEXT, dept_id INT, num_students INT); INSERT INTO departments (dept_id, dept_name) VALUES (1, 'Computer Science'), (2, 'Mathematics'), (3, 'English'); INSERT INTO courses (course_id, course_name, dept_id, num_students) VALUES (1, 'Intro to Programming', 1, 50), (2, 'Algebra', 2, 30), (3, 'Calculus', 2, 40), (4, 'English Composition', 3, 60), (5, 'Literature', 3, 45);
Sql: SELECT dept_name, MAX(num_students) as max_enrollment FROM departments JOIN courses ON departments.dept_id = courses.dept_id GROUP BY dept_name;

Sql Prompt: Compare the number of mobile subscribers using each technology between the Western and Eastern regions.
Sql Context: CREATE TABLE mobile_subscribers (subscriber_id INT, technology VARCHAR(20), region VARCHAR(50)); INSERT INTO mobile_subscribers (subscriber_id, technology, region) VALUES (1, '4G', 'North'), (2, '5G', 'North'), (3, '3G', 'South'), (4, '5G', 'East'), (5, '5G', 'North'), (6, '3G', 'South'), (7, '4G', 'West'), (8, '4G', 'East'), (9, '5G', 'East');
Sql: SELECT technology, region, COUNT(*) AS subscribers FROM mobile_subscribers GROUP BY technology, region HAVING region IN ('West', 'East') ORDER BY region, technology;

Sql Prompt: List the total number of cybersecurity incidents in the last 6 months, grouped by month.
Sql Context: CREATE TABLE incidents_monthly (id INT, incident_month DATE, incident_count INT); INSERT INTO incidents_monthly (id, incident_month, incident_count) VALUES (1, '2021-01-01', 150); INSERT INTO incidents_monthly (id, incident_month, incident_count) VALUES (2, '2021-02-01', 200);
Sql: SELECT DATE_FORMAT(incident_month, '%Y-%m') as month, SUM(incident_count) FROM incidents_monthly WHERE incident_month >= (SELECT DATE_SUB(CURRENT_DATE, INTERVAL 6 MONTH)) GROUP BY month;

Sql Prompt: What are the textile sourcing countries with a sustainability rating greater than 75?
Sql Context: CREATE TABLE sourcing (id INT, country VARCHAR(20), sustainability_rating INT); INSERT INTO sourcing (id, country, sustainability_rating) VALUES (1, 'China', 70); INSERT INTO sourcing (id, country, sustainability_rating) VALUES (2, 'Italy', 85);
Sql: SELECT country FROM sourcing WHERE sustainability_rating > 75;

---

Follow the following format.

Sql Prompt: Natural language query

Sql Context: Context for the query

Reasoning: Let's think step by step in order to ${produce the sql}. We ...

Sql: SQL query

---

Sql Prompt: What is the combined installed capacity of wind and solar power plants in China and India?

Sql Context: CREATE TABLE wind_plants (country VARCHAR(20), capacity INT); INSERT INTO wind_plants (country, capacity) VALUES ('China', 200000), ('India', 150000); CREATE TABLE solar_plants (country VARCHAR(20), capacity INT); INSERT INTO solar_plants (country, capacity) VALUES ('China', 250000), ('India', 200000);

Reasoning: Let's think step by step in order to produce the SQL query. We need to find the combined installed capacity of wind and solar power plants in China and India.

Sql: SELECT SUM(capacity) as combined_capacity FROM ( SELECT capacity FROM wind_plants WHERE country IN ('China', 'India') UNION ALL SELECT capacity FROM solar_plants WHERE country IN ('China', 'India') ) AS power_plants;

---

Sql Prompt: What are the top 5 most purchased lipsticks based on sales volume across all regions?

Sql Context: CREATE TABLE lipsticks (lipstick_id INT, lipstick_name VARCHAR(100), region VARCHAR(50), sales_volume INT); INSERT INTO lipsticks (lipstick_id, lipstick_name, region, sales_volume) VALUES (1, 'Ruby Woo', 'North America', 1500), (2, 'Russian Red', 'Europe', 1200), (3, 'Cherry', 'Asia', 1800), (4, 'Lady Danger', 'South America', 1000), (5, 'Mademoiselle', 'Australia', 1600);

Reasoning: Let's think step by step in order to produce the SQL query. We need to find the top 5 most purchased lipsticks based on sales volume across all regions.

Sql: SELECT lipstick_name, SUM(sales_volume) as total_sales_volume
FROM lipsticks
GROUP BY lipstick_name
ORDER BY total_sales_volume DESC
LIMIT 5;

#### Evaluate the optimized program

<div style="background-color: #E0F8E0; padding: 10px; border-radius: 5px;"> <p style="color: #006400; font-size: 18px; font-weight: bold; margin: 0;"> ✅ Evaluation Success </p> <p style="color: #006400; font-size: 16px; margin: 5px 0 0;"> With BootstrapFewShotWithRandomSearch Optimization, <strong>Starling7B</strong> achieves an <strong>80.0% correctness</strong> in the evaluation of 25 test samples. </p> </div>

In [30]:
evaluate(optmized_program_2)

  0%|          | 0/25 [00:00<?, ?it/s]

Average Metric: 20 / 25  (80.0): 100%|██████████| 25/25 [00:23<00:00,  1.08it/s]

Average Metric: 20 / 25  (80.0%)

/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:187: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df = df.applymap(truncate_cell)
/home/jjmov99/dspy-testing/.venv/lib/python3.11/site-packages/dspy/evaluate/evaluate.py:263: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '['1' '1' '1' '1' '1']' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  df.loc[:, metric_name] = df[metric_name].apply(

80.0